org/_posts/2017-08-28-gawk-exercise-answers.org
#+TITLE: GNU Awk's Manual Exercises
#+FILETAGS: :awk:solutions:
#+INCLUDE: "_include.org"
#+INCLUDE: "_exercises.org"
#+BEGIN_EXPORT html
<style>
div.org-src-container + pre.example {
  border-top: 3px ridge #073642;
  border-left: none;
  background: #fdf6e3;
}
</style>
#+END_EXPORT


* 
  [[https://www.gnu.org/software/gawk/manual/gawk.html#Print][The GNU Awk manual]] contains a handful of exercises to assist in learning
  =awk=.

  The manual doesn't contain answers to these exercises and having not found
  them elsewhere, I've published my own solutions here.
  
  All of the exercises use features /exclusively/ presented prior to the section
  where the exercise appears. If you think you've got a neat solution, [[https://github.com/zv/gawk-exercise/issues][please
  submit a pull request!]]

* Input
** #1
   #+BEGIN_VERSE
   Using the =FIELDWIDTHS= variable (see [[https://www.gnu.org/software/gawk/manual/gawk.html#Constant-Size][Constant Size]]), write a program to read
   election data, where each record represents one voter’s votes. Come up with a
   way to define which columns are associated with each ballot item, and print the
   total votes, including abstentions, for each item.
   #+END_VERSE
*** Answer
     #+BEGIN_SRC awk :in-file data/election_data :results value raw :exports both
       BEGIN  { FIELDWIDTHS = "18 9 15" }

       NR > 2 {
           if ($2 ~ "x") {
               gore++
           } else if ($3 ~ "x") {
               bush++
           } else {
               abstained++
           }
       }

       END { print "Bush:", bush, "Gore:", gore, "Abstained:", abstained }
     #+END_SRC

     #+RESULTS:
     : Bush: 9 Gore: 10 Abstained: 1

** #2
   #+BEGIN_VERSE
   Plain Getline, presented a program to remove C-style comments (‘/* … */’) from
   the input. That program does not work if one comment ends on one line and
   another one starts later on the same line. That can be fixed by making one
   simple change. What is it?
   #+END_VERSE

*** Answer
     #+BEGIN_SRC awk :in-file data/tcdrain.c :results pp :exports both
     {
         while ((i = index($0, "/*")) != 0) {
             out = substr($0, 1, i - 1)  # leading part of the string
             rest = substr($0, i + 2)    # ... */ ...
             j = index(rest, "*/")       # is */ in trailing part?
             if (j > 0) {
                 rest = substr(rest, j + 2)  # remove comment
             } else {
                 while (j == 0) {
                     # get more text
                     if (getline <= 0) {
                         print("unexpected EOF or error:", ERRNO) > "/dev/stderr"
                         exit
                     }
                     # build up the line using string concatenation
                     rest = rest $0
                     j = index(rest, "*/")   # is */ in trailing part?
                     if (j != 0) {
                         rest = substr(rest, j + 2)
                         break
                     }
                 }
             }
             # build up the output line using string concatenation
             $0 = out rest
         }
         print $0
     }
     #+END_SRC

     #+RESULTS:
     #+begin_example

     #include <errno.h>
     #include <termios.h>

     int __set_errno(int n) { return n; }

     int __libc_tcdrain (int fd) {
       if (fd < 0) {
           __set_errno (EBADF);
           return -1;
         }
        __set_errno (ENOSYS);
       return -1;
     }
 #+end_example

* Output
** #1
   #+BEGIN_VERSE
   Rewrite the program from Output Separators, by using a new value of OFS.
   #+END_VERSE
   
   #+BEGIN_SRC awk :in-file data/inventory-shipped :results pp :exports both
   BEGIN { print "Month Crates"; print "----- ------" }
   { print $1, "     ", $2 }
   #+END_SRC
   #+RESULTS:
   : Month Crates
   : ----- ------
   : Jan       13
   : Feb       15
   : Mar       15
   : Aug       11
   : Sep       25
   : Dec       6


*** Answer
     #+BEGIN_SRC awk :in-file data/inventory-shipped :results pp :exports both
     BEGIN { print "Month Crates"; print "----- ------"; OFS="     " }
     { print $1, $2 }
     #+END_SRC
     #+RESULTS:
     : Month Crates
     : ----- ------
     : Jan     13
     : Feb     15
     : Mar     15
     : Aug     11
     : Sep     25
     : Dec     6
* Library
** #1
   #+BEGIN_VERSE
   In Empty Files, we presented the ~zerofile.awk~ program, which made use of gawk’s
   =ARGIND= variable. Can this problem be solved without relying on =ARGIND=? If so,
   how?
   #+END_VERSE

