_posts/2017-08-28-gawk-exercise-answers.html
---
layout: page
title: GNU Awk's Manual Exercises
category: note
tags:
  - post
  - awk
  - solutions
---

<section id="outline-container-org5948d6f" class="outline-2">
<h2 id="org5948d6f"></h2>
<div class="outline-text-2" id="text-org5948d6f">
<p>
<a href="https://www.gnu.org/software/gawk/manual/gawk.html#Print">The GNU Awk manual</a> contains a handful of exercises to assist in learning
<span class="verbatim">awk</span>.
</p>

<p>
The manual doesn't contain answers to these exercises and having not found
them elsewhere, I've published my own solutions here.
</p>

<p>
All of the exercises use features <i>exclusively</i> presented prior to the section
where the exercise appears. If you think you've got a neat solution, <a href="https://github.com/zv/gawk-exercise/issues">please
submit a pull request!</a>
</p>
</div>
</section>

<section id="outline-container-org7874e2f" class="outline-2">
<h2 id="org7874e2f">Exercises</h2>
<div class="outline-text-2" id="text-org7874e2f">
</div>
<div id="outline-container-orge63a750" class="outline-3">
<h3 id="orge63a750">Input</h3>
<div class="outline-text-3" id="text-orge63a750">
</div>
<div id="outline-container-orgcbf8a71" class="outline-4">
<h4 id="orgcbf8a71">#1</h4>
<div class="outline-text-4" id="text-orgcbf8a71">
<blockquote>
<p>
Using the <span class="verbatim">FIELDWIDTHS</span> variable (see <a href="https://www.gnu.org/software/gawk/manual/gawk.html#Constant-Size">Constant Size</a>), write a program to read
election data, where each record represents one voter’s votes. Come up with a
way to define which columns are associated with each ballot item, and print the
total votes, including abstentions, for each item.
</p>
</blockquote>
</div>
<div id="outline-container-org8b149b8" class="outline-5">
<h5 id="org8b149b8">Answer</h5>
<div class="outline-text-5" id="text-org8b149b8">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #859900; font-weight: bold;">BEGIN</span>  <span style="color: #2aa198;">{</span> <span style="color: #268bd2;">FIELDWIDTHS</span> = <span style="color: #2aa198;">"18 9 15"</span> <span style="color: #2aa198;">}</span>

<span style="color: #268bd2;">NR</span> &gt; <span style="color: #6c71c4;">2</span> <span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>$2 ~ <span style="color: #2aa198;">"x"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        gore++
    <span style="color: #b58900;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>$3 ~ <span style="color: #2aa198;">"x"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        bush++
    <span style="color: #b58900;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #b58900;">{</span>
        abstained++
    <span style="color: #b58900;">}</span>
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">END</span> <span style="color: #2aa198;">{</span> <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">"Bush:"</span>, bush, <span style="color: #2aa198;">"Gore:"</span>, gore, <span style="color: #2aa198;">"Abstained:"</span>, abstained <span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgef9fa92" class="outline-4">
<h4 id="orgef9fa92">#2</h4>
<div class="outline-text-4" id="text-orgef9fa92">
<blockquote>
<p>
Plain Getline, presented a program to remove C-style comments (‘/* … */’) from
the input. That program does not work if one comment ends on one line and
another one starts later on the same line. That can be fixed by making one
simple change. What is it?
</p>
</blockquote>
</div>

<div id="outline-container-org9e27a95" class="outline-5">
<h5 id="org9e27a95">Answer</h5>
<div class="outline-text-5" id="text-org9e27a95">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">while</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>i = <span style="color: #268bd2;">index</span><span style="color: #6c71c4;">(</span>$0, <span style="color: #2aa198;">"/*"</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> != <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        out = <span style="color: #268bd2;">substr</span><span style="color: #268bd2;">(</span>$0, <span style="color: #6c71c4;">1</span>, i - <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span>  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">leading part of the string</span>
        rest = <span style="color: #268bd2;">substr</span><span style="color: #268bd2;">(</span>$0, i + <span style="color: #6c71c4;">2</span><span style="color: #268bd2;">)</span>    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">... */ ...</span>
        j = <span style="color: #268bd2;">index</span><span style="color: #268bd2;">(</span>rest, <span style="color: #2aa198;">"*/"</span><span style="color: #268bd2;">)</span>       <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">is */ in trailing part?</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>j &gt; <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            rest = <span style="color: #268bd2;">substr</span><span style="color: #6c71c4;">(</span>rest, j + <span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">)</span>  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">remove comment</span>
        <span style="color: #268bd2;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #268bd2;">{</span>
            <span style="color: #859900; font-weight: bold;">while</span> <span style="color: #6c71c4;">(</span>j == <span style="color: #6c71c4;">0</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">{</span>
                <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">get more text</span>
                <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">getline</span> &lt;= <span style="color: #6c71c4;">0</span><span style="color: #859900;">)</span> <span style="color: #859900;">{</span>
                    <span style="color: #268bd2;">print</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"unexpected EOF or error:"</span>, <span style="color: #268bd2;">ERRNO</span><span style="color: #b58900;">)</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
                    <span style="color: #859900; font-weight: bold;">exit</span>
                <span style="color: #859900;">}</span>
                <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">build up the line using string concatenation</span>
                rest = rest $0
                j = <span style="color: #268bd2;">index</span><span style="color: #859900;">(</span>rest, <span style="color: #2aa198;">"*/"</span><span style="color: #859900;">)</span>   <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">is */ in trailing part?</span>
                <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>j != <span style="color: #6c71c4;">0</span><span style="color: #859900;">)</span> <span style="color: #859900;">{</span>
                    rest = <span style="color: #268bd2;">substr</span><span style="color: #b58900;">(</span>rest, j + <span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span>
                    <span style="color: #859900; font-weight: bold;">break</span>
                <span style="color: #859900;">}</span>
            <span style="color: #6c71c4;">}</span>
        <span style="color: #268bd2;">}</span>
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">build up the output line using string concatenation</span>
        $0 = out rest
    <span style="color: #b58900;">}</span>
    <span style="color: #268bd2;">print</span> $0
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org0ce0e5b" class="outline-3">
<h3 id="org0ce0e5b">Output</h3>
<div class="outline-text-3" id="text-org0ce0e5b">
</div>
<div id="outline-container-org51a1067" class="outline-4">
<h4 id="org51a1067">#1</h4>
<div class="outline-text-4" id="text-org51a1067">
<blockquote>
<p>
Rewrite the program:
</p>
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #859900; font-weight: bold;">BEGIN</span> <span style="color: #2aa198;">{</span> <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">"Month Crates"</span>; <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">"----- ------"</span> <span style="color: #2aa198;">}</span>
<span style="color: #2aa198;">{</span> <span style="color: #268bd2;">print</span> $1, <span style="color: #2aa198;">"     "</span>, $2 <span style="color: #2aa198;">}</span>
</pre>
</div>

<p>
from Output Separators, by using a new value of OFS.
</p>
</blockquote>
</div>

<div id="outline-container-org3c1871f" class="outline-5">
<h5 id="org3c1871f">Answer</h5>
<div class="outline-text-5" id="text-org3c1871f">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #859900; font-weight: bold;">BEGIN</span> <span style="color: #2aa198;">{</span> <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">"Month Crates"</span>; <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">"----- ------"</span>; <span style="color: #268bd2;">OFS</span>=<span style="color: #2aa198;">"     "</span> <span style="color: #2aa198;">}</span>
<span style="color: #2aa198;">{</span> <span style="color: #268bd2;">print</span> $1, $2 <span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org010ceb5" class="outline-3">
<h3 id="org010ceb5">Library</h3>
<div class="outline-text-3" id="text-org010ceb5">
</div>
<div id="outline-container-org953279e" class="outline-4">
<h4 id="org953279e">#1</h4>
<div class="outline-text-4" id="text-org953279e">
<blockquote>
<p>
In Empty Files, we presented the <code>zerofile.awk</code> program, which made use of gawk’s
<span class="verbatim">ARGIND</span> variable. Can this problem be solved without relying on <span class="verbatim">ARGIND</span>? If so,
how?
</p>
</blockquote>
</div>
