org/_posts/2017-08-28-gawk-exercise-answers.org
*** Answer
     Use ~ENDFILE~ to run a function at the end of each file. You could match
     ~argc~/~argv~ as well if you wanted to determine the index of the filename
     argument.

     #+BEGIN_SRC awk :in-file data/empty data/empty1 :results pp :exports both
     ENDFILE { print(FILENAME, ++argi) }
     #+END_SRC

     #+RESULTS:
     : data/empty 1
     : data/empty1 2
** #2
   #+BEGIN_VERSE
   As a related challenge, revise that code to handle the case where an
   intervening value in ~ARGV~ is a variable assignment.
   #+END_VERSE

   #+BEGIN_SRC awk :cmd-line "--assign=nval=9" :in-file data/empty data/empty1 :results pp :exports both
     ENDFILE {
       if (argv[argi++] !~ /^[a-zA-Z_][a-zA-Z0-9_]*=.*/) {
           print(FILENAME, argi)
       }
     }
   #+END_SRC

   #+RESULTS:
   : data/empty 1
   : data/empty1 2
* Programs
** #1
   #+BEGIN_VERSE
   Rewrite cut.awk (see [[https://www.gnu.org/software/gawk/manual/gawk.html#Cut-Program][Cut Program]]) using ~split()~ with "" as the separator.
   #+END_VERSE
