_posts/2017-08-28-gawk-exercise-answers.html

<div id="outline-container-orgfffcfb3" class="outline-5">
<h5 id="orgfffcfb3">Answer</h5>
<div class="outline-text-5" id="text-orgfffcfb3">
<p>
Use <code>ENDFILE</code> to run a function at the end of each file. You could match
<code>argc~/~argv</code> as well if you wanted to determine the index of the filename
argument.
</p>

<div class="org-src-container">
<pre class="src src-awk">ENDFILE <span style="color: #2aa198;">{</span> <span style="color: #268bd2;">print</span><span style="color: #b58900;">(</span><span style="color: #268bd2;">FILENAME</span>, ++argi<span style="color: #b58900;">)</span> <span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org62b2a55" class="outline-4">
<h4 id="org62b2a55">#2</h4>
<div class="outline-text-4" id="text-org62b2a55">
<blockquote>
<p>
As a related challenge, revise that code to handle the case where an
intervening value in <code>ARGV</code> is a variable assignment.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-awk">ENDFILE <span style="color: #2aa198;">{</span>
  <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>argv<span style="color: #268bd2;">[</span>argi++<span style="color: #268bd2;">]</span> !~ <span style="color: #2aa198;">/^[a-zA-Z_][a-zA-Z0-9_]*=.*/</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
      <span style="color: #268bd2;">print</span><span style="color: #268bd2;">(</span><span style="color: #268bd2;">FILENAME</span>, argi<span style="color: #268bd2;">)</span>
  <span style="color: #b58900;">}</span>
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6342af4" class="outline-3">
<h3 id="org6342af4">Programs</h3>
<div class="outline-text-3" id="text-org6342af4">
</div>
<div id="outline-container-orga91a9f6" class="outline-4">
<h4 id="orga91a9f6">#1</h4>
<div class="outline-text-4" id="text-orga91a9f6">
<blockquote>
<p>
Rewrite cut.awk (see <a href="https://www.gnu.org/software/gawk/manual/gawk.html#Cut-Program">Cut Program</a>) using <code>split()</code> with "" as the separator.
</p>
</blockquote>
</div>
