_posts/2017-08-28-gawk-exercise-answers.html
<div id="outline-container-orgb4e20db" class="outline-5">
<h5 id="orgb4e20db">Answer</h5>
<div class="outline-text-5" id="text-orgb4e20db">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">cut.awk --- implement cut in awk</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Options:</span>
<span style="color: #93a1a1;">#    </span><span style="color: #93a1a1;">-f list     Cut fields</span>
<span style="color: #93a1a1;">#    </span><span style="color: #93a1a1;">-d c        Field delimiter character</span>
<span style="color: #93a1a1;">#    </span><span style="color: #93a1a1;">-c list     Cut characters</span>
<span style="color: #93a1a1;">#</span>
<span style="color: #93a1a1;">#    </span><span style="color: #93a1a1;">-s          Suppress lines without the delimiter</span>
<span style="color: #93a1a1;">#</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Requires getopt() and join() library functions</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">usage</span><span style="color: #2aa198;">()</span>
<span style="color: #2aa198;">{</span>
    <span style="color: #268bd2;">print</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"usage: cut [-f list] [-d c] [-s] [files...]"</span><span style="color: #b58900;">)</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
    <span style="color: #268bd2;">print</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"usage: cut [-c list] [files...]"</span><span style="color: #b58900;">)</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
    <span style="color: #859900; font-weight: bold;">exit</span> <span style="color: #6c71c4;">1</span>
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">BEGIN</span> <span style="color: #2aa198;">{</span>
    <span style="color: #268bd2;">FS</span> = <span style="color: #2aa198;">"\t"</span>    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">default</span>
    <span style="color: #268bd2;">OFS</span> = <span style="color: #268bd2;">FS</span>
    <span style="color: #859900; font-weight: bold;">while</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>c = getopt<span style="color: #6c71c4;">(</span><span style="color: #268bd2;">ARGC</span>, <span style="color: #268bd2;">ARGV</span>, <span style="color: #2aa198;">"sf:c:d:"</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> != -<span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>c == <span style="color: #2aa198;">"f"</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            by_fields = <span style="color: #6c71c4;">1</span>
            fieldlist = Optarg
        <span style="color: #268bd2;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>c == <span style="color: #2aa198;">"c"</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            by_chars = <span style="color: #6c71c4;">1</span>
            fieldlist = Optarg
            <span style="color: #268bd2;">OFS</span> = <span style="color: #2aa198;">""</span>
        <span style="color: #268bd2;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>c == <span style="color: #2aa198;">"d"</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">length</span><span style="color: #859900;">(</span>Optarg<span style="color: #859900;">)</span> &gt; <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">{</span>
                <span style="color: #268bd2;">printf</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"cut: using first character of %s"</span> \
                       <span style="color: #2aa198;">" for delimiter\n"</span>, Optarg<span style="color: #859900;">)</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
                Optarg = <span style="color: #268bd2;">substr</span><span style="color: #859900;">(</span>Optarg, <span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span>
            <span style="color: #6c71c4;">}</span>
            fs = <span style="color: #268bd2;">FS</span> = Optarg
            <span style="color: #268bd2;">OFS</span> = <span style="color: #268bd2;">FS</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">FS</span> == <span style="color: #2aa198;">" "</span><span style="color: #6c71c4;">)</span>    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">defeat awk semantics</span>
                <span style="color: #268bd2;">FS</span> = <span style="color: #2aa198;">"[ ]"</span>
        <span style="color: #268bd2;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>c == <span style="color: #2aa198;">"s"</span><span style="color: #268bd2;">)</span>
            suppress = <span style="color: #6c71c4;">1</span>
        <span style="color: #859900; font-weight: bold;">else</span>
            usage<span style="color: #268bd2;">()</span>
    <span style="color: #b58900;">}</span>

    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Clear out options</span>
    <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>i = <span style="color: #6c71c4;">1</span>; i &lt; Optind; i++<span style="color: #b58900;">)</span>
        <span style="color: #268bd2;">ARGV</span><span style="color: #b58900;">[</span>i<span style="color: #b58900;">]</span> = <span style="color: #2aa198;">""</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>by_fields &amp;&amp; by_chars<span style="color: #b58900;">)</span>
        usage<span style="color: #b58900;">()</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>by_fields == <span style="color: #6c71c4;">0</span> &amp;&amp; by_chars == <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span>
        by_fields = <span style="color: #6c71c4;">1</span>    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">default</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>fieldlist == <span style="color: #2aa198;">""</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">"cut: needs list for -c or -f"</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
        <span style="color: #859900; font-weight: bold;">exit</span> <span style="color: #6c71c4;">1</span>
    <span style="color: #b58900;">}</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>by_fields<span style="color: #b58900;">)</span>
        set_fieldlist<span style="color: #b58900;">()</span>
    <span style="color: #859900; font-weight: bold;">else</span>
        set_charlist<span style="color: #b58900;">()</span>
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">set_fieldlist</span><span style="color: #2aa198;">(</span>n, m, i, j, k, f, g<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">{</span>
    n = <span style="color: #268bd2;">split</span><span style="color: #b58900;">(</span>fieldlist, f, <span style="color: #2aa198;">","</span><span style="color: #b58900;">)</span>
    j = <span style="color: #6c71c4;">1</span>    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">index in flist</span>
    <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>i = <span style="color: #6c71c4;">1</span>; i &lt;= n; i++<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">index</span><span style="color: #6c71c4;">(</span>f<span style="color: #859900;">[</span>i<span style="color: #859900;">]</span>, <span style="color: #2aa198;">"-"</span><span style="color: #6c71c4;">)</span> != <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">a range</span>
            m = <span style="color: #268bd2;">split</span><span style="color: #6c71c4;">(</span>f<span style="color: #859900;">[</span>i<span style="color: #859900;">]</span>, g, <span style="color: #2aa198;">"-"</span><span style="color: #6c71c4;">)</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>m != <span style="color: #6c71c4;">2</span> || g<span style="color: #859900;">[</span><span style="color: #6c71c4;">1</span><span style="color: #859900;">]</span> &gt;= g<span style="color: #859900;">[</span><span style="color: #6c71c4;">2</span><span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">{</span>
                <span style="color: #268bd2;">printf</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"cut: bad field list: %s\n"</span>,
                                  f<span style="color: #b58900;">[</span>i<span style="color: #b58900;">]</span><span style="color: #859900;">)</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
                <span style="color: #859900; font-weight: bold;">exit</span> <span style="color: #6c71c4;">1</span>
            <span style="color: #6c71c4;">}</span>
            <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #6c71c4;">(</span>k = g<span style="color: #859900;">[</span><span style="color: #6c71c4;">1</span><span style="color: #859900;">]</span>; k &lt;= g<span style="color: #859900;">[</span><span style="color: #6c71c4;">2</span><span style="color: #859900;">]</span>; k++<span style="color: #6c71c4;">)</span>
                flist<span style="color: #6c71c4;">[</span>j++<span style="color: #6c71c4;">]</span> = k
        <span style="color: #268bd2;">}</span> <span style="color: #859900; font-weight: bold;">else</span>
            flist<span style="color: #268bd2;">[</span>j++<span style="color: #268bd2;">]</span> = f<span style="color: #268bd2;">[</span>i<span style="color: #268bd2;">]</span>
    <span style="color: #b58900;">}</span>
    nfields = j - <span style="color: #6c71c4;">1</span>
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">set_charlist</span><span style="color: #2aa198;">(</span>    field, i, j, f, g, n, m, t,
                          filler, last, len<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">{</span>
    field = <span style="color: #6c71c4;">1</span>   <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">count total fields</span>
    n = <span style="color: #268bd2;">split</span><span style="color: #b58900;">(</span>fieldlist, f, <span style="color: #2aa198;">","</span><span style="color: #b58900;">)</span>
    j = <span style="color: #6c71c4;">1</span>       <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">index in flist</span>
    <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>i = <span style="color: #6c71c4;">1</span>; i &lt;= n; i++<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">index</span><span style="color: #6c71c4;">(</span>f<span style="color: #859900;">[</span>i<span style="color: #859900;">]</span>, <span style="color: #2aa198;">"-"</span><span style="color: #6c71c4;">)</span> != <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">range</span>
            m = <span style="color: #268bd2;">split</span><span style="color: #6c71c4;">(</span>f<span style="color: #859900;">[</span>i<span style="color: #859900;">]</span>, g, <span style="color: #2aa198;">"-"</span><span style="color: #6c71c4;">)</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>m != <span style="color: #6c71c4;">2</span> || g<span style="color: #859900;">[</span><span style="color: #6c71c4;">1</span><span style="color: #859900;">]</span> &gt;= g<span style="color: #859900;">[</span><span style="color: #6c71c4;">2</span><span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">{</span>
                <span style="color: #268bd2;">printf</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"cut: bad character list: %s\n"</span>,
                               f<span style="color: #b58900;">[</span>i<span style="color: #b58900;">]</span><span style="color: #859900;">)</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
                <span style="color: #859900; font-weight: bold;">exit</span> <span style="color: #6c71c4;">1</span>
            <span style="color: #6c71c4;">}</span>
            len = g<span style="color: #6c71c4;">[</span><span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">]</span> - g<span style="color: #6c71c4;">[</span><span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">]</span> + <span style="color: #6c71c4;">1</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>g<span style="color: #859900;">[</span><span style="color: #6c71c4;">1</span><span style="color: #859900;">]</span> &gt; <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span>  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">compute length of filler</span>
                filler = g<span style="color: #6c71c4;">[</span><span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">]</span> - last - <span style="color: #6c71c4;">1</span>
            <span style="color: #859900; font-weight: bold;">else</span>
                filler = <span style="color: #6c71c4;">0</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>filler<span style="color: #6c71c4;">)</span>
                t<span style="color: #6c71c4;">[</span>field++<span style="color: #6c71c4;">]</span> = filler
            t<span style="color: #6c71c4;">[</span>field++<span style="color: #6c71c4;">]</span> = len  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">length of field</span>
            last = g<span style="color: #6c71c4;">[</span><span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">]</span>
            flist<span style="color: #6c71c4;">[</span>j++<span style="color: #6c71c4;">]</span> = field - <span style="color: #6c71c4;">1</span>
        <span style="color: #268bd2;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #268bd2;">{</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>f<span style="color: #859900;">[</span>i<span style="color: #859900;">]</span> &gt; <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span>
                filler = f<span style="color: #6c71c4;">[</span>i<span style="color: #6c71c4;">]</span> - last - <span style="color: #6c71c4;">1</span>
            <span style="color: #859900; font-weight: bold;">else</span>
                filler = <span style="color: #6c71c4;">0</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>filler<span style="color: #6c71c4;">)</span>
                t<span style="color: #6c71c4;">[</span>field++<span style="color: #6c71c4;">]</span> = filler
            t<span style="color: #6c71c4;">[</span>field++<span style="color: #6c71c4;">]</span> = <span style="color: #6c71c4;">1</span>
            last = f<span style="color: #6c71c4;">[</span>i<span style="color: #6c71c4;">]</span>
            flist<span style="color: #6c71c4;">[</span>j++<span style="color: #6c71c4;">]</span> = field - <span style="color: #6c71c4;">1</span>
        <span style="color: #268bd2;">}</span>
    <span style="color: #b58900;">}</span>
    <span style="color: #268bd2;">FIELDWIDTHS</span> = join<span style="color: #b58900;">(</span>t, <span style="color: #6c71c4;">1</span>, field - <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span>
    nfields = j - <span style="color: #6c71c4;">1</span>
<span style="color: #2aa198;">}</span>

<span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>by_fields &amp;&amp; suppress &amp;&amp; <span style="color: #268bd2;">index</span><span style="color: #268bd2;">(</span>$0, fs<span style="color: #268bd2;">)</span> == <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span>
        <span style="color: #859900; font-weight: bold;">next</span>

    <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>i = <span style="color: #6c71c4;">1</span>; i &lt;= nfields; i++<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>$flist<span style="color: #6c71c4;">[</span>i<span style="color: #6c71c4;">]</span> != <span style="color: #2aa198;">""</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            <span style="color: #268bd2;">printf</span> <span style="color: #2aa198;">"%s"</span>, $flist<span style="color: #6c71c4;">[</span>i<span style="color: #6c71c4;">]</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>i &lt; nfields &amp;&amp; $flist<span style="color: #859900;">[</span>i+<span style="color: #6c71c4;">1</span><span style="color: #859900;">]</span> != <span style="color: #2aa198;">""</span><span style="color: #6c71c4;">)</span>
                <span style="color: #268bd2;">printf</span> <span style="color: #2aa198;">"%s"</span>, <span style="color: #268bd2;">OFS</span>
        <span style="color: #268bd2;">}</span>
    <span style="color: #b58900;">}</span>
    <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">""</span>
<span style="color: #2aa198;">}</span>

</pre>
</div>
</div>
</div>
</div>
