_posts/2017-08-28-gawk-exercise-answers.html

<div id="outline-container-orgbba4ce9" class="outline-4">
<h4 id="orgbba4ce9">#2</h4>
<div class="outline-text-4" id="text-orgbba4ce9">
<blockquote>
<p>
In <a href="https://www.gnu.org/software/gawk/manual/gawk.html#Egrep-Program">Egrep Program</a>, we mentioned that <code>‘egrep -i’</code> could be simulated in
versions of <span class="verbatim">awk</span> without <span class="verbatim">IGNORECASE</span> by using <span class="verbatim">tolower()</span> on the line and the
pattern. In a footnote there, we also mentioned that this solution has a
bug: the translated line is output, and not the original one. Fix this
problem.
</p>
</blockquote>
</div>
<div id="outline-container-orgb588e2d" class="outline-5">
<h5 id="orgb588e2d">Answer</h5>
<div class="outline-text-5" id="text-orgb588e2d">
<p>
Simply check the results of <span class="verbatim">tolower()</span> without assigning output.
</p>
</div>
</div>
</div>

<div id="outline-container-org6839790" class="outline-4">
<h4 id="org6839790">#3</h4>
<div class="outline-text-4" id="text-org6839790">
<blockquote>
<p>
The POSIX version of <span class="verbatim">id</span> takes options that control which information is
printed. Modify the <span class="verbatim">awk</span> version (see <a href="https://www.gnu.org/software/gawk/manual/gawk.html#Id-Program">Id Program</a>) to accept the same
arguments and perform in the same way.
</p>
</blockquote>
</div>

<div id="outline-container-org586baff" class="outline-5">
<h5 id="org586baff">Answer</h5>
<div class="outline-text-5" id="text-org586baff">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">id.awk --- implement id in awk</span>
<span style="color: #93a1a1;">#</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Requires user and group library functions</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">output is:</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">uid=12(foo) euid=34(bar) gid=3(baz) \</span>
<span style="color: #93a1a1;">#             </span><span style="color: #93a1a1;">egid=5(blat) groups=9(nine),2(two),1(one)</span>
@include <span style="color: #2aa198;">"vendor/group.awk"</span>
@include <span style="color: #2aa198;">"vendor/passwd.awk"</span>
@include <span style="color: #2aa198;">"vendor/getopt.awk"</span>

<span style="color: #859900; font-weight: bold;">BEGIN</span> <span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">ARGC</span> &lt; <span style="color: #6c71c4;">2</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        print_uid++
        print_egid++
        print_groups++
    <span style="color: #b58900;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">while</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>c = getopt<span style="color: #859900;">(</span><span style="color: #268bd2;">ARGC</span>, <span style="color: #268bd2;">ARGV</span>, <span style="color: #2aa198;">"gGnru"</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span> != -<span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>c == <span style="color: #2aa198;">"g"</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">{</span> print_gid++ <span style="color: #6c71c4;">}</span>
            <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>c == <span style="color: #2aa198;">"G"</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">{</span> print_groups++ <span style="color: #6c71c4;">}</span>
            <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>c == <span style="color: #2aa198;">"u"</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">{</span> print_uid++ <span style="color: #6c71c4;">}</span>
        <span style="color: #268bd2;">}</span>
    <span style="color: #b58900;">}</span>

    uid = <span style="color: #268bd2;">PROCINFO</span><span style="color: #b58900;">[</span><span style="color: #2aa198;">"uid"</span><span style="color: #b58900;">]</span>
    euid = <span style="color: #268bd2;">PROCINFO</span><span style="color: #b58900;">[</span><span style="color: #2aa198;">"euid"</span><span style="color: #b58900;">]</span>
    gid = <span style="color: #268bd2;">PROCINFO</span><span style="color: #b58900;">[</span><span style="color: #2aa198;">"gid"</span><span style="color: #b58900;">]</span>
    egid = <span style="color: #268bd2;">PROCINFO</span><span style="color: #b58900;">[</span><span style="color: #2aa198;">"egid"</span><span style="color: #b58900;">]</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>print_uid<span style="color: #b58900;">)</span>
        <span style="color: #268bd2;">printf</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"uid=%d"</span>, uid<span style="color: #b58900;">)</span>
    pw = getpwuid<span style="color: #b58900;">(</span>uid<span style="color: #b58900;">)</span>
    pr_first_field<span style="color: #b58900;">(</span>pw<span style="color: #b58900;">)</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>print_uid &amp;&amp; euid != uid<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #268bd2;">printf</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">" euid=%d"</span>, euid<span style="color: #268bd2;">)</span>
        pw = getpwuid<span style="color: #268bd2;">(</span>euid<span style="color: #268bd2;">)</span>
        pr_first_field<span style="color: #268bd2;">(</span>pw<span style="color: #268bd2;">)</span>
    <span style="color: #b58900;">}</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>print_gid<span style="color: #b58900;">)</span>
        <span style="color: #268bd2;">printf</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">" gid=%d"</span>, gid<span style="color: #b58900;">)</span>
    pw = getgrgid<span style="color: #b58900;">(</span>gid<span style="color: #b58900;">)</span>
    pr_first_field<span style="color: #b58900;">(</span>pw<span style="color: #b58900;">)</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>print_gid &amp;&amp; egid != gid<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #268bd2;">printf</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">" egid=%d"</span>, egid<span style="color: #268bd2;">)</span>
        pw = getgrgid<span style="color: #268bd2;">(</span>egid<span style="color: #268bd2;">)</span>
        pr_first_field<span style="color: #268bd2;">(</span>pw<span style="color: #268bd2;">)</span>
    <span style="color: #b58900;">}</span>

    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>print_groups<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #268bd2;">(</span>i = <span style="color: #6c71c4;">1</span>; <span style="color: #6c71c4;">(</span><span style="color: #2aa198;">"group"</span> i<span style="color: #6c71c4;">)</span> <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #268bd2;">PROCINFO</span>; i++<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>i == <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span>
                <span style="color: #268bd2;">printf</span><span style="color: #6c71c4;">(</span><span style="color: #2aa198;">" groups="</span><span style="color: #6c71c4;">)</span>
            group = <span style="color: #268bd2;">PROCINFO</span><span style="color: #6c71c4;">[</span><span style="color: #2aa198;">"group"</span> i<span style="color: #6c71c4;">]</span>
            <span style="color: #268bd2;">printf</span><span style="color: #6c71c4;">(</span><span style="color: #2aa198;">"%d"</span>, group<span style="color: #6c71c4;">)</span>
            pw = getgrgid<span style="color: #6c71c4;">(</span>group<span style="color: #6c71c4;">)</span>
            pr_first_field<span style="color: #6c71c4;">(</span>pw<span style="color: #6c71c4;">)</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span><span style="color: #2aa198;">"group"</span> <span style="color: #b58900;">(</span>i+<span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #268bd2;">PROCINFO</span><span style="color: #6c71c4;">)</span>
                <span style="color: #268bd2;">printf</span><span style="color: #6c71c4;">(</span><span style="color: #2aa198;">","</span><span style="color: #6c71c4;">)</span>
        <span style="color: #268bd2;">}</span>
    <span style="color: #b58900;">}</span>

    <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">""</span>
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">pr_first_field</span><span style="color: #2aa198;">(</span>str,  a<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>str != <span style="color: #2aa198;">""</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #268bd2;">split</span><span style="color: #268bd2;">(</span>str, a, <span style="color: #2aa198;">":"</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">printf</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">"(%s)"</span>, a<span style="color: #6c71c4;">[</span><span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #b58900;">}</span>
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgd4b09f7" class="outline-4">
<h4 id="orgd4b09f7">#6</h4>
<div class="outline-text-4" id="text-orgd4b09f7">
<blockquote>
<p>
Why can’t the <span class="verbatim">wc.awk</span> program (see <a href="https://www.gnu.org/software/gawk/manual/gawk.html#Wc-Program">Wc Program</a>) just use the value of <span class="verbatim">FNR</span> in
<span class="verbatim">endfile()</span>? Hint: Examine the code in <a href="https://www.gnu.org/software/gawk/manual/gawk.html#Filetrans-Function">Filetrans Function</a>.
</p>
</blockquote>
</div>
