_posts/2017-08-28-gawk-exercise-answers.html
<div id="outline-container-org36bf2fe" class="outline-5">
<h5 id="org36bf2fe">Answer</h5>
<div class="outline-text-5" id="text-org36bf2fe">
<p>
This is a confusing question because <span class="verbatim">ENDFILE</span> <b>can</b> use <span class="verbatim">FNR</span>, but this
question concerns an arbitrary user-defined function coincidentally named
<span class="verbatim">endfile()</span> which cannot. <span class="verbatim">endfile()</span> is run within the body of
<span class="verbatim">END</span>, which as the manual indicates, only occurs as the termination of
the entire program.
</p>
</div>
</div>
</div>

<div id="outline-container-org6392086" class="outline-4">
<h4 id="org6392086">#7</h4>
<div class="outline-text-4" id="text-org6392086">
<blockquote>
<p>
Manipulation of individual characters in the <span class="verbatim">translate</span> program (see <a href="https://www.gnu.org/software/gawk/manual/gawk.html#Translate-Program">Translate Program</a>) 
is painful using standard awk functions. Given that <span class="verbatim">gawk</span> can split strings
into individual characters using "" as the separator, how might you use this
feature to simplify the program?
</p>
</blockquote>
</div>

<div id="outline-container-org962333d" class="outline-5">
<h5 id="org962333d">Answer</h5>
<div class="outline-text-5" id="text-org962333d">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">stranslate</span><span style="color: #2aa198;">(</span>from, to, target, lf, lt, ltarget, t_ar, i, c, result<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">{</span>
    <span style="color: #268bd2;">split</span><span style="color: #b58900;">(</span>from, f_a, <span style="color: #2aa198;">""</span><span style="color: #b58900;">)</span>;
    <span style="color: #268bd2;">split</span><span style="color: #b58900;">(</span>to, t_a, <span style="color: #2aa198;">""</span><span style="color: #b58900;">)</span>;
    <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>i <span style="color: #859900; font-weight: bold;">in</span> f_a<span style="color: #b58900;">)</span> t_ar<span style="color: #b58900;">[</span>f_a<span style="color: #268bd2;">[</span>i<span style="color: #268bd2;">]</span><span style="color: #b58900;">]</span> = t_a<span style="color: #b58900;">[</span>i<span style="color: #b58900;">]</span>;
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>lt &lt; lf<span style="color: #b58900;">)</span>
        <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>; i &lt;= lf; i++<span style="color: #b58900;">)</span> t_ar<span style="color: #b58900;">[</span>f_a<span style="color: #268bd2;">[</span>i<span style="color: #268bd2;">]</span><span style="color: #b58900;">]</span> = t_a<span style="color: #b58900;">[</span><span style="color: #268bd2;">length</span><span style="color: #268bd2;">(</span>t_a<span style="color: #268bd2;">)</span><span style="color: #b58900;">]</span>

    <span style="color: #268bd2;">split</span><span style="color: #b58900;">(</span>target, target_chs, <span style="color: #2aa198;">""</span><span style="color: #b58900;">)</span>
    <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>idx <span style="color: #859900; font-weight: bold;">in</span> target_chs<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        c = target<span style="color: #268bd2;">[</span>chs<span style="color: #268bd2;">]</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>c <span style="color: #859900; font-weight: bold;">in</span> t_ar<span style="color: #268bd2;">)</span> target_chs<span style="color: #268bd2;">[</span>c<span style="color: #268bd2;">]</span> = t_ar<span style="color: #268bd2;">[</span>c<span style="color: #268bd2;">]</span>
        result = result c
    <span style="color: #b58900;">}</span>

    <span style="color: #859900; font-weight: bold;">return</span> result
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">translate</span><span style="color: #2aa198;">(</span>from, to<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span> <span style="color: #859900; font-weight: bold;">return</span> $0 = stranslate<span style="color: #b58900;">(</span>from, to, $0<span style="color: #b58900;">)</span> <span style="color: #2aa198;">}</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">main program</span>
<span style="color: #859900; font-weight: bold;">BEGIN</span> <span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">ARGC</span> &lt; <span style="color: #6c71c4;">3</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #268bd2;">print</span> <span style="color: #2aa198;">"usage: translate from to"</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
        <span style="color: #859900; font-weight: bold;">exit</span>
    <span style="color: #b58900;">}</span>
    FROM = <span style="color: #268bd2;">ARGV</span><span style="color: #b58900;">[</span><span style="color: #6c71c4;">1</span><span style="color: #b58900;">]</span>
    TO = <span style="color: #268bd2;">ARGV</span><span style="color: #b58900;">[</span><span style="color: #6c71c4;">2</span><span style="color: #b58900;">]</span>
    <span style="color: #268bd2;">ARGC</span> = <span style="color: #6c71c4;">2</span>
    <span style="color: #268bd2;">ARGV</span><span style="color: #b58900;">[</span><span style="color: #6c71c4;">1</span><span style="color: #b58900;">]</span> = <span style="color: #2aa198;">"-"</span>
<span style="color: #2aa198;">}</span>

<span style="color: #2aa198;">{</span>
    translate<span style="color: #b58900;">(</span>FROM, TO<span style="color: #b58900;">)</span>
    <span style="color: #268bd2;">print</span>
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org95cffd9" class="outline-4">
<h4 id="org95cffd9">#8</h4>
<div class="outline-text-4" id="text-org95cffd9">
<blockquote>
<p>
The <code>extract.awk</code> program (see <a href="https://www.gnu.org/software/gawk/manual/gawk.html#Extract-Program">Extract Program</a>) was written before <span class="verbatim">gawk</span> had
the <code>gensub()</code> function. Use it to simplify the code.
</p>
</blockquote>
</div>
