org/_posts/2017-08-28-gawk-exercise-answers.org
*** Answer

     #+BEGIN_SRC awk :in-file data/gawk.texti :results pp :exports both
       BEGIN    { IGNORECASE = 1 }

       /^@c(omment)?[ \t]+system/ {
           if (NF < 3) {
               e = ("extract: " FILENAME ":" FNR)
               e = (e  ": badly formed `system' line")
               print e > "/dev/stderr"
               next
           }
           $1 = ""
           $2 = ""
           stat = system($0)
           if (stat != 0) {
               e = ("extract: " FILENAME ":" FNR)
               e = (e ": warning: system returned " stat)
               print e > "/dev/stderr"
           }
       }

       /^@c(omment)?[ \t]+file/ {
           if (NF != 3) {
               e = ("extract: " FILENAME ":" FNR ": badly formed `file' line")
               print e > "/dev/stderr"
               next
           }
           if ($3 != curfile) {
               if (curfile != "")
                   close(curfile)
               curfile = $3
           }

           for (;;) {
               if ((getline line) <= 0)
                   unexpected_eof()
               if (line ~ /^@c(omment)?[ \t]+endfile/)
                   break
               else if (line ~ /^@(end[ \t]+)?group/)
                   continue
               else if (line ~ /^@c(omment+)?[ \t]+/)
                   continue
               gensub(/@[^@]o/, "\\1", "g", line)
               if (index(line, "@") == 0) {
                   print line > curfile
                   continue
               }
               n = split(line, a, "@")
               # if a[1] == "", means leading @,
               # don't add one back in.
               for (i = 2; i <= n; i++) {
                   if (a[i] == "") { # was an @@
                       a[i] = "@"
                       if (a[i+1] == "")
                           i++
                   }
               }
               print join(a, 1, n, SUBSEP) > curfile
           }
       }

       function join(array, start, end, sep, result, i)
       {
           if (sep == "")
              sep = " "
           else if (sep == SUBSEP) # magic value
              sep = ""
           result = array[start]
           for (i = start + 1; i <= end; i++)
               result = result sep array[i]
           return result
       }

       function unexpected_eof()
       {
           printf("extract: %s:%d: unexpected EOF or error\n",
                            FILENAME, FNR) > "/dev/stderr"
           exit 1
       }

       END {
           if (curfile) close(curfile)
           # to accommodate literate programming, print out our file
           while (getline tmp < curfile) print tmp
       }
     #+END_SRC

     #+RESULTS:
     : BEGIN { print "Don't panic!" }
     : END { print "Always avoid bored archaeologists!" }
