_posts/2017-08-28-gawk-exercise-answers.html
<div id="outline-container-org4b7a1cd" class="outline-5">
<h5 id="org4b7a1cd">Answer</h5>
<div class="outline-text-5" id="text-org4b7a1cd">
<div class="org-src-container">
<pre class="src src-awk"><span style="color: #859900; font-weight: bold;">BEGIN</span>    <span style="color: #2aa198;">{</span> <span style="color: #268bd2;">IGNORECASE</span> = <span style="color: #6c71c4;">1</span> <span style="color: #2aa198;">}</span>

<span style="color: #2aa198;">/^@c(omment)?[ \t]+system/</span> <span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">NF</span> &lt; <span style="color: #6c71c4;">3</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        e = <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"extract: "</span> <span style="color: #268bd2;">FILENAME</span> <span style="color: #2aa198;">":"</span> <span style="color: #268bd2;">FNR</span><span style="color: #268bd2;">)</span>
        e = <span style="color: #268bd2;">(</span>e  <span style="color: #2aa198;">": badly formed `system' line"</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">print</span> e &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
        <span style="color: #859900; font-weight: bold;">next</span>
    <span style="color: #b58900;">}</span>
    $1 = <span style="color: #2aa198;">""</span>
    $2 = <span style="color: #2aa198;">""</span>
    stat = <span style="color: #268bd2;">system</span><span style="color: #b58900;">(</span>$0<span style="color: #b58900;">)</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>stat != <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        e = <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"extract: "</span> <span style="color: #268bd2;">FILENAME</span> <span style="color: #2aa198;">":"</span> <span style="color: #268bd2;">FNR</span><span style="color: #268bd2;">)</span>
        e = <span style="color: #268bd2;">(</span>e <span style="color: #2aa198;">": warning: system returned "</span> stat<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">print</span> e &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
    <span style="color: #b58900;">}</span>
<span style="color: #2aa198;">}</span>

<span style="color: #2aa198;">/^@c(omment)?[ \t]+file/</span> <span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">NF</span> != <span style="color: #6c71c4;">3</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        e = <span style="color: #268bd2;">(</span><span style="color: #2aa198;">"extract: "</span> <span style="color: #268bd2;">FILENAME</span> <span style="color: #2aa198;">":"</span> <span style="color: #268bd2;">FNR</span> <span style="color: #2aa198;">": badly formed `file' line"</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">print</span> e &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
        <span style="color: #859900; font-weight: bold;">next</span>
    <span style="color: #b58900;">}</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>$3 != curfile<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>curfile != <span style="color: #2aa198;">""</span><span style="color: #268bd2;">)</span>
            <span style="color: #268bd2;">close</span><span style="color: #268bd2;">(</span>curfile<span style="color: #268bd2;">)</span>
        curfile = $3
    <span style="color: #b58900;">}</span>

    <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>;;<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">getline</span> line<span style="color: #6c71c4;">)</span> &lt;= <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span>
            unexpected_eof<span style="color: #268bd2;">()</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>line ~ <span style="color: #2aa198;">/^@c(omment)?[ \t]+endfile/</span><span style="color: #268bd2;">)</span>
            <span style="color: #859900; font-weight: bold;">break</span>
        <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>line ~ <span style="color: #2aa198;">/^@(end[ \t]+)?group/</span><span style="color: #268bd2;">)</span>
            <span style="color: #859900; font-weight: bold;">continue</span>
        <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>line ~ <span style="color: #2aa198;">/^@c(omment+)?[ \t]+/</span><span style="color: #268bd2;">)</span>
            <span style="color: #859900; font-weight: bold;">continue</span>
        <span style="color: #268bd2;">gensub</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">/@[^@]o/</span>, <span style="color: #2aa198;">"\\1"</span>, <span style="color: #2aa198;">"g"</span>, line<span style="color: #268bd2;">)</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">index</span><span style="color: #6c71c4;">(</span>line, <span style="color: #2aa198;">"@"</span><span style="color: #6c71c4;">)</span> == <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            <span style="color: #268bd2;">print</span> line &gt; curfile
            <span style="color: #859900; font-weight: bold;">continue</span>
        <span style="color: #268bd2;">}</span>
        n = <span style="color: #268bd2;">split</span><span style="color: #268bd2;">(</span>line, a, <span style="color: #2aa198;">"@"</span><span style="color: #268bd2;">)</span>
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">if a[1] == "", means leading @,</span>
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">don't add one back in.</span>
        <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #268bd2;">(</span>i = <span style="color: #6c71c4;">2</span>; i &lt;= n; i++<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
            <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>a<span style="color: #859900;">[</span>i<span style="color: #859900;">]</span> == <span style="color: #2aa198;">""</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">{</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">was an @@</span>
                a<span style="color: #859900;">[</span>i<span style="color: #859900;">]</span> = <span style="color: #2aa198;">"@"</span>
                <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>a<span style="color: #b58900;">[</span>i+<span style="color: #6c71c4;">1</span><span style="color: #b58900;">]</span> == <span style="color: #2aa198;">""</span><span style="color: #859900;">)</span>
                    i++
            <span style="color: #6c71c4;">}</span>
        <span style="color: #268bd2;">}</span>
        <span style="color: #268bd2;">print</span> join<span style="color: #268bd2;">(</span>a, <span style="color: #6c71c4;">1</span>, n, <span style="color: #268bd2;">SUBSEP</span><span style="color: #268bd2;">)</span> &gt; curfile
    <span style="color: #b58900;">}</span>
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">join</span><span style="color: #2aa198;">(</span>array, start, end, sep, result, i<span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>sep == <span style="color: #2aa198;">""</span><span style="color: #b58900;">)</span>
       sep = <span style="color: #2aa198;">" "</span>
    <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>sep == <span style="color: #268bd2;">SUBSEP</span><span style="color: #b58900;">)</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">magic value</span>
       sep = <span style="color: #2aa198;">""</span>
    result = array<span style="color: #b58900;">[</span>start<span style="color: #b58900;">]</span>
    <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #b58900;">(</span>i = start + <span style="color: #6c71c4;">1</span>; i &lt;= end; i++<span style="color: #b58900;">)</span>
        result = result sep array<span style="color: #b58900;">[</span>i<span style="color: #b58900;">]</span>
    <span style="color: #859900; font-weight: bold;">return</span> result
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">unexpected_eof</span><span style="color: #2aa198;">()</span>
<span style="color: #2aa198;">{</span>
    <span style="color: #268bd2;">printf</span><span style="color: #b58900;">(</span><span style="color: #2aa198;">"extract: %s:%d: unexpected EOF or error\n"</span>,
                     <span style="color: #268bd2;">FILENAME</span>, <span style="color: #268bd2;">FNR</span><span style="color: #b58900;">)</span> &gt; <span style="color: #268bd2;">"/dev/stderr"</span>
    <span style="color: #859900; font-weight: bold;">exit</span> <span style="color: #6c71c4;">1</span>
<span style="color: #2aa198;">}</span>

<span style="color: #859900; font-weight: bold;">END</span> <span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>curfile<span style="color: #b58900;">)</span> <span style="color: #268bd2;">close</span><span style="color: #b58900;">(</span>curfile<span style="color: #b58900;">)</span>
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">to accommodate literate programming, print out our file</span>
    <span style="color: #859900; font-weight: bold;">while</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">getline</span> tmp &lt; curfile<span style="color: #b58900;">)</span> <span style="color: #268bd2;">print</span> tmp
<span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</section>
